# =================================
# File : fenci.py
# Description : 
# Author : ChenX
# CREATE TIME : 2024/1/13 15:13
# =================================
import hanlp

HanLP = hanlp.load(hanlp.pretrained.mtl.CLOSE_TOK_POS_NER_SRL_DEP_SDP_CON_ELECTRA_SMALL_ZH)  # 世界最大中文语料库


doc = HanLP.parse(['卡尔文森号航母参与的战役有哪些？', '威廉·库尔特所属组织是什么？', '南沙群岛的下属岛礁有哪些？', '哈马斯武装的领导人是谁？', '南沙群岛的下属岛礁',
     '哈马斯武装的领导人'], tasks=['srl'])
# print(HanLP(
#     ['卡尔文森号航母参与的战役有哪些？', '威廉·库尔特所属组织是什么？', '南沙群岛的下属岛礁有哪些？', '哈马斯武装的领导人是谁？', '南沙群岛的下属岛礁',
#      '哈马斯武装的领导人']))
# ['开源', '软件', '应', '秉持', '全人类', '共享', '的', '精神', '，', '搞', '封闭式', '是', '行', '不通', '的', '。']
# 可通过 jiojio.help() 获取基本使用方式说明
# 可通过 print(jiojio.init.__doc__) 获取模型初始化的各类参数
